app/controllers/businesses_controller.rb

INSERT INTO `businesses` (`address`, `category`, `city`, `company_name`, `contact_name`, `employee`, `fax_number`, `fri_closed`, `fri_from`, `fri_to`, `gender`, `gmaps`, `latitude`, `longitude`, `major_division_description`, `mon_closed`, `mon_from`, `mon_to`, `phone`, `sales`, `sat_closed`, `sat_from`, `sat_to`, `sic_2_code_description`, `sic_4_code`, `state`, `sun_closed`, `sun_from`, `sun_to`, `thu_closed`, `thu_from`, `thu_to`, `title`, `tue_closed`, `tue_from`, `tue_to`, `url`, `wed_closed`, `wed_from`, `wed_to`, `zip_code`) VALUES ('bangalore', 'food', 'bangalore', 'good', NULL, NULL, NULL, '0', NULL, NULL, NULL, NULL, 20.0, -121.0, NULL, '0', NULL, NULL, '4125873698', NULL, '0', NULL, NULL, NULL, NULL, 'IN', '0', NULL, NULL, '0', NULL, NULL, NULL, '0', NULL, NULL, NULL, '0', NULL, NULL, NULL)
---
  def create
    @business = Business.new(params[:business].reject{ |key, value| value.blank?})
    if @business.save

SELECT DISTINCT city,state FROM `businesses` WHERE (city LIKE 'b%')
---
  def cities
    @cities = Business.select('DISTINCT city,state').where("city LIKE ?", "#{params[:city]}%")

SELECT DISTINCT company_name FROM `businesses` WHERE (address IS NOT NULL and company_name LIKE 'd%' and city = 'Calgary')
---
  def city_businesses
    @name = params[:company_name].split(' and').join(' &')
    @cities = Business.select('DISTINCT company_name').where("address IS NOT NULL and company_name LIKE ? and city = ?", "#{@name}%", "#{session[:city]}")

SELECT `businesses`.* FROM `businesses` WHERE ((company_name sounds LIKE 'good%' or company_name sounds LIKE 'good') and city sounds LIKE 'bangalore%') LIMIT 1
SELECT COUNT(*) FROM `businesses` WHERE ((businesses.latitude BETWEEN 39.97494916889152 AND 42.869584831108476 AND businesses.longitude BETWEEN -78.76528882592112 AND -74.90502317407888 AND 3958.755864232 * 2 * ASIN(SQRT(POWER(SIN((41.422267 - businesses.latitude) * PI() / 180 / 2), 2) + COS(41.422267 * PI() / 180) * COS(businesses.latitude * PI() / 180) * POWER(SIN((-76.835156 - businesses.longitude) * PI() / 180 / 2), 2))) <= 100) and (company_name = 'good' and address IS NOT NULL and city IS NOT NULL and address != 'bangalore' and id NOT IN ('29831') and (mon_from IS NOT NULL and tue_from IS NOT NULL and wed_from IS NOT NULL and thu_from IS NOT NULL and fri_from IS NOT NULL and sat_from IS NOT NULL and sun_from IS NOT NULL)))
---
  def search
    if params[:company_name].present?
      @name = params[:company_name].split(' and').join(' &')
      a = Time.zone.now.strftime("%a").downcase+"_to"
      b = Time.zone.now.strftime("%a").downcase+"_from"
      if !(params[:location_page].present? or params[:category_page].present?)
        @ab_business_databases = Business.search "(*#{@name}*, *#{session[:city]}*)", :limit => 1
        if @ab_business_databases.empty?

SELECT `businesses`.* FROM `businesses` WHERE `businesses`.`id` = 13 LIMIT 1
---
  def edit
    @business = Business.find(params[:id])

SELECT `businesses`.* FROM `businesses` WHERE `businesses`.`id` = 13 LIMIT 1
UPDATE `businesses` SET `mon_from` = '12:00', `mon_to` = '12:00', `tue_from` = '12:00', `tue_to` = '12:00', `wed_from` = '12:00', `wed_to` = '12:00', `thu_from` = '12:00', `thu_to` = '12:00', `fri_from` = '12:00', `fri_to` = '12:00', `sat_from` = '12:00', `sat_to` = '12:00', `sun_from` = '12:00', `sun_to` = '12:00' WHERE `businesses`.`id` = 13
---
  def update
    @business = Business.find(params[:id])
    if @business.update_attributes(params[:business].reject{ |key, value| value.blank?} )