app/controllers/imports_controller.rb

  def index
    @per_page = params[:per_page] || 10
    @businesses = Business.where("company_name IS NOT NULL and address IS NOT NULL").order('id Desc').paginate(:per_page => @per_page, :page => params[:page])
    @export_businesses = Business.order(:id).limit(25000)
---
SELECT COUNT(*) FROM `businesses` WHERE (company_name IS NOT NULL and address IS NOT NULL)
SELECT `businesses`.* FROM `businesses` WHERE (company_name IS NOT NULL and address IS NOT NULL) ORDER BY id Desc LIMIT 10 OFFSET 0
SELECT `businesses`.* FROM `businesses` ORDER BY id LIMIT 25000